
## Plan Result (prod_vpn_gateway)




<pre><code>Plan: 5 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_public_ip.this[0]
  * azurerm_resource_group.this[0]
  * azurerm_virtual_network_gateway.this[0]
  * module.networking[0].azurerm_subnet.this[&#34;vpn-gateway&#34;]
  * module.networking[0].azurerm_virtual_network.this[&#34;vpn&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_public_ip.this[0] will be created
  + resource "azurerm_public_ip" "this" {
      + allocation_method       = "Dynamic"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "uksouth"
      + name                    = "lab-vpn-prod-public-ip"
      + resource_group_name     = "lab-vpn-prod-rg"
      + sku                     = "Standard"
      + sku_tier                = "Regional"
    }

  # azurerm_resource_group.this[0] will be created
  + resource "azurerm_resource_group" "this" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "lab-vpn-prod-rg"
    }

  # azurerm_virtual_network_gateway.this[0] will be created
  + resource "azurerm_virtual_network_gateway" "this" {
      + active_active                         = false
      + bgp_route_translation_for_nat_enabled = false
      + enable_bgp                            = true
      + generation                            = (known after apply)
      + id                                    = (known after apply)
      + ip_sec_replay_protection_enabled      = true
      + location                              = "uksouth"
      + name                                  = "lab-vpn-prod-gateway"
      + remote_vnet_traffic_enabled           = false
      + resource_group_name                   = "lab-vpn-prod-rg"
      + sku                                   = "Basic"
      + type                                  = "Vpn"
      + virtual_wan_traffic_enabled           = false
      + vpn_type                              = "RouteBased"

      + bgp_settings (known after apply)

      + ip_configuration {
          + name                          = "vnetGatewayConfig"
          + private_ip_address_allocation = "Dynamic"
          + public_ip_address_id          = (known after apply)
          + subnet_id                     = (known after apply)
        }
    }

  # module.networking[0].azurerm_subnet.this["vpn-gateway"] will be created
  + resource "azurerm_subnet" "this" {
      + address_prefixes                              = [
          + "10.151.200.0/24",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "GatewaySubnet"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "lab-vpn-prod-rg"
      + virtual_network_name                          = "lab-vpn-vpn-prod"
    }

  # module.networking[0].azurerm_virtual_network.this["vpn"] will be created
  + resource "azurerm_virtual_network" "this" {
      + address_space       = [
          + "10.151.200.0/24",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "uksouth"
      + name                = "lab-vpn-vpn-prod"
      + resource_group_name = "lab-vpn-prod-rg"
      + subnet              = (known after apply)
      + tags                = {
          + "application" = "vpn-gateway"
          + "environment" = "prod"
        }
    }

Plan: 5 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":405,"Program":"tfcmt","SHA1":"","Target":"prod_vpn_gateway","Vars":{}} -->